[Demo_CommonAD_ep4_1 GG2CollectionDemoScript]
DemoScripts[0]=(Actor=FADE,Command=SET,SecTime=0,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[1]=(Actor=CAMERA,Command=SET,SetType=POS,Vec=(X=2136,Y=-2193,Z=135),SecTime=)
DemoScripts[2]=(Actor=CAMERA,Command=SET,SetType=ROT,Vec=(X=-90,Y=-5,Z=0),SecTime=)
DemoScripts[3]=(Actor=CHARACTER,Command=POP,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',Vec=(X=2136,Y=-2383,Z=0),VecSub=(X=90,Y=0,Z=0),CId=71)
DemoScripts[4]=(Actor=SYSTEM,Command=INIT_WAIT)
DemoScripts[5]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0001_lp_open_angry",motionName[1]="ek_CM_0000_fx_close_normal",motionName[2]="ek_DM_0100_lp_Stand",Rate=0,Number=3,Bit=5)
DemoScripts[6]=(Actor=BGM,Command=PLAY,SecTime=0,SoundID=SoundCue'GG2_BGM_DM_CMN_Positive.GG2_BGM_DM_CMN_Positive_Cue')
DemoScripts[7]=(Actor=AMBIENT,Command=PLAY,SecTime=0,SoundID=SoundCue'AMB_Campus_2.GG2_AMB_Campus_2_LP_Cue')
DemoScripts[8]=(Actor=FADE,Command=EXIT,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[9]=(Actor=FADE,Command=WAIT)
DemoScripts[10]=(Actor=WINDOW,Command=SET)
DemoScripts[11]=(Actor=TEXT,Command=SET,ID=TEXT01)
DemoScripts[12]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_CommonAD_ep4_1.GG2_V_CMNAD_ep4_1_002_Cue',Name="エコロ")
DemoScripts[13]=(Actor=TEXT,Command=SET,ID=TEXT02)
DemoScripts[14]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[15]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0001_lp_open_angry",motionName[1]="ek_CM_0001_fx_close_down",motionName[2]="ek_DM_0110_fx_Stand2Go",Rate=0,Number=3,Bit=1)
DemoScripts[16]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_1000_lp_Go",Number=8)
DemoScripts[17]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_CommonAD_ep4_1.GG2_V_CMNAD_ep4_1_003_Cue',Name="エコロ")
DemoScripts[18]=(Actor=TEXT,Command=SET,ID=TEXT03)
DemoScripts[19]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[20]=(Actor=TEXT,Command=SET,ID=TEXT04)
DemoScripts[21]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0000_lp_open_normal",motionName[1]="ek_CM_0000_fx_close_normal",motionName[2]="ek_DM_1001_fx_Go2Stand",Rate=0,Number=3,Bit=1)
DemoScripts[22]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0100_lp_Stand",Number=8)
DemoScripts[23]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_CommonAD_ep4_1.GG2_V_CMNAD_ep4_1_005_Cue',Name="エコロ")
DemoScripts[24]=(Actor=TEXT,Command=SET,ID=TEXT05)
DemoScripts[25]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[26]=(Actor=TEXT,Command=SET,ID=TEXT06)
DemoScripts[27]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0001_lp_open_angry",Rate=0,Number=0,Bit=1)
DemoScripts[28]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_CommonAD_ep4_1.GG2_V_CMNAD_ep4_1_007_Cue',Name="エコロ")
DemoScripts[29]=(Actor=TEXT,Command=SET,ID=TEXT07)
DemoScripts[30]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[31]=(Actor=TEXT,Command=SET,ID=TEXT08)
DemoScripts[32]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0100_lp_close_normal",motionName[1]="ek_CM_0000_fx_close_normal",motionName[2]="ek_DM_0102_fx_Stand2Displease",Rate=0,Number=3,Bit=1)
DemoScripts[33]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0200_lp_Displease",Number=8)
DemoScripts[34]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_CommonAD_ep4_1.GG2_V_CMNAD_ep4_1_009_Cue',Name="エコロ")
DemoScripts[35]=(Actor=TEXT,Command=SET,ID=TEXT09)
DemoScripts[36]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[37]=(Actor=TEXT,Command=SET,ID=TEXT10)
DemoScripts[38]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_CommonAD_ep4_1.GG2_V_CMNAD_ep4_1_011_Cue',Name="")
DemoScripts[39]=(Actor=TEXT,Command=SET,ID=TEXT11)
DemoScripts[40]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[41]=(Actor=TEXT,Command=SET,ID=TEXT12)
DemoScripts[42]=(Actor=SOUND,Command=PLAY,SoundID=SoundCue'SE_DM_Common.GG2_SE_Manpu_Pressure_Cue')
DemoScripts[43]=(Actor=EMOTION,Command=SET,Name="エコロ",Number=1,CId=71)
DemoScripts[44]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0002_lp_open_perplex",motionName[1]="ek_CM_0001_fx_close_down",motionName[2]="ek_DM_0201_fx_Displease2Stand",Rate=0,Number=3,Bit=1)
DemoScripts[45]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0100_lp_Stand",Number=8)
DemoScripts[46]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_CommonAD_ep4_1.GG2_V_CMNAD_ep4_1_013_Cue',Name="エコロ")
DemoScripts[47]=(Actor=TEXT,Command=SET,ID=TEXT13)
DemoScripts[48]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[49]=(Actor=TEXT,Command=SET,ID=TEXT14)
DemoScripts[50]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0001_lp_open_angry",motionName[1]="ek_CM_0001_fx_close_down",motionName[2]="ek_DM_0110_fx_Stand2Go",Rate=0,Number=3,Bit=1)
DemoScripts[51]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_1000_lp_Go",Number=8)
DemoScripts[52]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_CommonAD_ep4_1.GG2_V_CMNAD_ep4_1_015_Cue',Name="エコロ")
DemoScripts[53]=(Actor=TEXT,Command=SET,ID=TEXT15)
DemoScripts[54]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[55]=(Actor=TEXT,Command=SET,ID=TEXT16)
DemoScripts[56]=(Actor=WINDOW,Command=EXIT)
DemoScripts[57]=(Actor=FADE,Command=SET,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[58]=(Actor=BGM,Command=STOP,SecTime=2,SoundID=)
DemoScripts[59]=(Actor=AMBIENT,Command=STOP,SecTime=2,SoundID=)
DemoScripts[60]=(Actor=SYSTEM,Command=WAIT,SecTime=2)
DemoScripts[61]=(Actor=SYSTEM,Command=END)

[Select_CommonAD_ep4_1 GG2CollectionSelect]
Selects[0]=(Label="SELECT00",SelectNumber=5,Select[0]=(TextLabel="SELECT01",Goto="JUMP01",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT02",Goto="JUMP02",ParamType=NO_PARAM,ParamNum=0),Select[2]=(TextLabel="SELECT03",Goto="JUMP03",ParamType=NO_PARAM,ParamNum=0),Select[3]=(TextLabel="SELECT04",Goto="JUMP04",ParamType=NO_PARAM,ParamNum=0),Select[4]=(TextLabel="SELECT05",Goto="JUMP05",ParamType=NO_PARAM,ParamNum=0))
Selects[1]=(Label="SELECT01",SelectNumber=5,Select[0]=(TextLabel="SELECT06",Goto="JUMP06",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT07",Goto="JUMP07",ParamType=NO_PARAM,ParamNum=0),Select[2]=(TextLabel="SELECT08",Goto="JUMP08",ParamType=NO_PARAM,ParamNum=0),Select[3]=(TextLabel="SELECT09",Goto="JUMP09",ParamType=NO_PARAM,ParamNum=0),Select[4]=(TextLabel="SELECT10",Goto="JUMP10",ParamType=NO_PARAM,ParamNum=0))

[Text_CommonAD_ep4_1 GG2CollectionText]
Texts[0]=(Label="TEXT01",Name="峯大",Text="好,那今後的方針就這麼定囉.")

Texts[1]=(Label="TEXT02",Name="艾可蘿",Text="是的,捉住那可恨的惡魔,/n搶奪惡魔長槍!")

Texts[2]=(Label="TEXT03",Name="艾可蘿",Text="在那之後,一鼓作氣/n往峯大大人的屁股刺下去!")

Texts[3]=(Label="TEXT04",Name="峯大",Text="不,沒必要刺屁股吧./n......對吧?")

Texts[4]=(Label="TEXT05",Name="艾可蘿",Text="是的./n沒有必要.")

Texts[5]=(Label="TEXT06",Name="峯大",Text="那妳為什麼要這麼說?")

Texts[6]=(Label="TEXT07",Name="艾可蘿",Text="不,該怎麼說呢,/n就只是順勢而已.")

Texts[7]=(Label="TEXT08",Name="峯大",Text="......嘴上說得很不情願,/n興致卻很高昂啊......我看妳只是/n對那個惡魔女孩挾帶私怨而已吧.")

Texts[8]=(Label="TEXT09",Name="艾可蘿",Text="我可是天使./n是和憎恨之類的感情無緣,/n神聖而廉潔的存在唷.")

Texts[9]=(Label="TEXT10",Name="峯大",Text="我怎麼記得剛開始的時候,/n妳是不是對我說過/n復仇心怎樣的話啊......")

Texts[10]=(Label="TEXT11",Name="艾可蘿",Text="\"......峯大大人才是,造成現在/n這樣的狀況也是那個惡魔的錯,/n所以再多燃起一點復仇心也沒關係唷.\"")

Texts[11]=(Label="TEXT12",Name="峯大",Text="啊啊,沒錯沒錯,就是這個.")

Texts[12]=(Label="TEXT13",Name="艾可蘿",Text="請不要為了抓人家的小辮子/n特地引用過去的發言!")

Texts[13]=(Label="TEXT14",Name="峯大",Text="唉,能夠和平解決的話/n那當然是最好啦......")

Texts[14]=(Label="TEXT15",Name="艾可蘿",Text="好了,峯大大人!/n要趁著那可恨的惡魔還沒使壞的時候/n把她的長槍搶過來!")

Texts[15]=(Label="TEXT16",Name="峯大",Text="妳剛剛說了\"可恨\"對吧?/n果然是懷恨在心嘛.")

Texts[16]=(Label="",Name="",Text="")

Texts[17]=(Label="SELECT01",Name="",Text="")

Texts[18]=(Label="SELECT02",Name="",Text="")

Texts[19]=(Label="SELECT03",Name="",Text="")

Texts[20]=(Label="SELECT04",Name="",Text="")

Texts[21]=(Label="SELECT05",Name="",Text="")

Texts[22]=(Label="SELECT06",Name="",Text="")

Texts[23]=(Label="SELECT07",Name="",Text="")

Texts[24]=(Label="SELECT08",Name="",Text="")

Texts[25]=(Label="SELECT09",Name="",Text="")

Texts[26]=(Label="SELECT10",Name="",Text="")


